---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.Flow
source: html/a476f7d6-0e62-1c81-4375-8abf65c5f90b.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.Flow Property

The calculated flow of this segment, in ft^3/s. The positive value means the flow is from the start to the end node, the negative value means opposite direction.

## Syntax (C#)
```csharp
public double Flow { get; }
```